---
kind: other
id: Properties.T:Autodesk.Revit.DB.DirectContext3D.IndexStreamTriangle
source: html/79a9b03c-5fad-2545-45c1-4241d1db8d1a.htm
---
# IndexStreamTriangle Properties

Specifies whether the .NET object represents a valid Revit entity.